Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotPasteInSketch Property
 Can't paste elements into sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPasteInSketch { get; }
Public Shared ReadOnly Property CannotPasteInSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPasteInSketch {
	FailureDefinitionId^ get ();
}
static member CannotPasteInSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace